<template>
  <v-theme-provider :dark="dark">
    <div>
      <base-title
        size="body-1"
        space="4"
        title="后记 Causerie"
        weight="regular"
      />

      <base-body>
        2019年3月，我从生物专业转到了计算机专业，一眨眼，就到了做毕业论文的时候。
        第一次接触编程，是在2013年我上高一的时候，在信息技术课上被强迫学Basic。
        可能是因为老师不会教，又或者是由于当时对电脑技术的抵触，非常讨厌编程。
        直到2017年我上大二，经过了一学期公共编程课的洗礼，对编程由讨厌逐渐变为喜欢。
        在爱尔兰交换快回国的时候，我发觉自己不适合读现在的专业，于是回国之后就跳槽进了计算机。
        <br><br>
        相比于生科院悠闲自在的日子，在计系每学期每一天都是一场关于学业的战斗。
        我转过来已经四个学期了，专业跨度之大，每个学期都被繁重且难度大的课业压得喘不过气。
        在我得知本科学业只是打基础，工作内容还得从头学的时候，心态有点小崩溃。
        Web前后端技术前前后后学了小半年，这期间逐渐形成了自己的一套方法，也积累了大量的技术经验。
        <br><br>
        选题的时候正好在申请研究生，于是乎就做了个留学论坛。当然，网站只是技术的载体，具体内容并不重要。
        网站编码花了大概两个月的时间，从刚开始的技术探索到完工，不得不感叹这个世界其实是一门CURD的艺术。
        开发不仅仅是开发，也是前沿技术的融合。譬如，计算机图形学优化了前端，机器学习和深度学习优化了后端。
        我相信随着技术的不断发展，最后能留下的一定是写源码的那批人。
        <br><br>写于 February 2021
      </base-body>
    </div>
  </v-theme-provider>
</template>

<script>
  export default {
    name: 'BaseInfo',

    props: {
      title: String,
      dark: Boolean,
    },
  }
</script>
